/**
 * @author sk
 * @time 2022/9/14
 * @desc say
 **/
public class L300 {

    /*
     * //给你一个整数数组 nums ，找到其中最长严格递增子序列的长度。
     * //
     * // 子序列 是由数组派生而来的序列，删除（或不删除）数组中的元素而不改变其余元素的顺序。例如，[3,6,2,7] 是数组 [0,3,1,6,2,2,7] 的子
     * //序列。
     * //
     * // 示例 1：
     * //
     * //
     * //输入：nums = [10,9,2,5,3,7,101,18]
     * //输出：4
     * //解释：最长递增子序列是 [2,3,7,101]，因此长度为 4 。
     * //
     * //
     * // 示例 2：
     * //
     * //
     * //输入：nums = [0,1,0,3,2,3]
     * //输出：4
     * //
     * //
     * // 示例 3：
     * //
     * //
     * //输入：nums = [7,7,7,7,7,7,7]
     * //输出：1
     * //
     * //
     * //
     * //
     * // 提示：
     * //
     * //
     * // 1 <= nums.length <= 2500
     * // -10⁴ <= nums[i] <= 10⁴
     * //
     * //
     * //
     * //
     * // 进阶：
     * //
     * //
     * // 你能将算法的时间复杂度降低到 O(n log(n)) 吗?
     * //
     * //
     * // Related Topics 数组 二分查找 动态规划 👍 2784 👎 0
     */

    /**
     * 执行耗时:55 ms,击败了71.93% 的Java用户
     * 内存消耗:40.7 MB,击败了94.44% 的Java用户
     *
     * @param nums
     * @return
     */
    public static int handle(int[] nums) {
        int len = nums.length;
        int[] dp = new int[len];
        int res = 1;
        for (int i = 0; i < len; i++) {
            dp[i] = 1;
            for (int j = 0; j < i; j++) {
                if (nums[i] > nums[j]) {
                    dp[i] = Math.max(dp[i], dp[j] + 1);
                }
            }
            res = Math.max(dp[i], res);
        }
        return res;
    }

    public static void main(String[] args) {
        int[] nums;
        nums = new int[]{4, 10, 4, 3, 8, 9};
        System.err.println(handle(nums));
        nums = new int[]{10, 9, 2, 5, 3, 7, 101, 18};
        System.err.println(handle(nums));
    }

}
